
[
  {
    "id": "portfolio-json",
    "title": "JSON-Powered Portfolio",
    "subtitle": "This Very Website",
    "intro": "A minimal, fast personal portfolio website where all content is sourced from local JSON files, emphasizing a content-as-data architecture.",
    "content": "<div><p>This project is a practical implementation of a 'No CMS' philosophy. By storing all content—from project descriptions to essays—in structured JSON files within the GitHub repository, the entire site becomes version-controlled, transparent, and easily editable with a simple text editor. The front-end, built with Next.js and Tailwind CSS, is a static-first application that fetches and renders this data at build time, ensuring maximum performance and security.</p><p>Key features include a client-side search function written in plain JavaScript, dynamic page generation for categories and individual posts, and a clean, responsive design. The workflow is streamlined: edit a JSON file, commit, and deploy. It's an exercise in simplicity and developer-centric content management.</p></div>",
    "date": "2024-07-20",
    "tags": ["nextjs", "react", "tailwindcss", "json", "architecture"],
    "thumbnail": "project-1-thumb",
    "translations": {
      "nl": {
        "title": "JSON-aangedreven Portfolio",
        "subtitle": "Deze Zelfgemaakte Website",
        "intro": "Een minimale, snelle persoonlijke portfoliowebsite waarbij alle content afkomstig is van lokale JSON-bestanden, met de nadruk op een content-als-data-architectuur.",
        "content": "<div><p>Dit project is een praktische implementatie van een 'Geen CMS'-filosofie. Door alle content — van projectbeschrijvingen tot essays — op te slaan in gestructureerde JSON-bestanden binnen de GitHub-repository, wordt de hele site versiebeheerd, transparant en gemakkelijk te bewerken met een eenvoudige teksteditor. De front-end, gebouwd met Next.js en Tailwind CSS, is een static-first applicatie die deze gegevens ophaalt en rendert tijdens de build, wat maximale prestaties en veiligheid garandeert.</p><p>Belangrijke kenmerken zijn een client-side zoekfunctie geschreven in puur JavaScript, dynamische paginageneratie voor categorieën en individuele posts, en een strak, responsief ontwerp. De workflow is gestroomlijnd: bewerk een JSON-bestand, commit en deploy. Het is een oefening in eenvoud en ontwikkelaar-gericht contentbeheer.</p></div>"
      }
    }
  },
  {
    "id": "data-visualization-kit",
    "title": "Data Visualization Kit",
    "subtitle": "A Component Library for React",
    "intro": "A custom-built component library designed to simplify the creation of interactive and aesthetically pleasing charts and graphs in React applications.",
    "content": "<div><p>Frustrated with the complexity and heavy dependencies of existing charting libraries, I developed a lightweight Data Visualization Kit. Built with React and styled-components, it provides a set of reusable components for common chart types like bar, line, and pie charts. The library is designed with a focus on customization and performance, using CSS variables for easy theming and minimizing re-renders through memoization.</p><p>The project involved a deep dive into SVG manipulation, animation with Framer Motion, and building an accessible and developer-friendly API. It's currently used in several internal dashboards and has significantly reduced the time required to build data-rich interfaces.</p></div>",
    "date": "2023-11-05",
    "tags": ["react", "typescript", "data-visualization", "library", "design-systems"],
    "thumbnail": "project-2-thumb"
  },
  {
    "id": "ai-powered-chat-agent",
    "title": "AI-Powered Chat Agent",
    "subtitle": "A Customer Service Bot with Memory",
    "intro": "Building a conversational AI using modern LLMs and vector databases to provide contextual and persistent customer support across sessions.",
    "content": "<div><p>This project explores the integration of large language models (LLMs) with a persistent memory store to create a more effective customer service chatbot. Unlike traditional stateless bots, this agent can recall previous interactions with a user, providing a more natural and helpful conversational flow. The backend is built with Python, using a vector database to store and retrieve conversation embeddings for long-term memory. The frontend is a simple React application that communicates with the agent via a WebSocket connection for real-time interaction. The project focuses on the challenges of managing conversation context and preventing topic drift.</p></div>",
    "date": "2024-07-26",
    "tags": ["ai", "llm", "chatbots", "python", "react", "vector-database"],
    "thumbnail": "project-3-thumb"
  },
  {
    "id": "smart-home-dashboard",
    "title": "Smart Home Dashboard",
    "subtitle": "A Central Hub for IoT Devices",
    "intro": "A responsive web application to monitor and control various smart home devices from a single, unified interface.",
    "content": "<div><p>This project was born out of a desire to unify the disparate apps and interfaces for various IoT devices in my home. The dashboard is built with SvelteKit and communicates with devices via a central MQTT broker. A Node.js service acts as a bridge, translating device-specific protocols (Zigbee, Wi-Fi) into standardized MQTT messages. The frontend features a dynamic, grid-based layout that is fully customizable by the user, allowing them to arrange controls for lights, sensors, and media players as they see fit. It's a fully self-hosted solution that prioritizes local control and privacy.</p></div>",
    "date": "2024-07-27",
    "tags": ["iot", "sveltekit", "nodejs", "mqtt", "home-automation"],
    "thumbnail": "project-4-thumb"
  },
  {
    "id": "interactive-code-notebook",
    "title": "Interactive Code Notebook",
    "subtitle": "A Web-Based Learning Environment",
    "intro": "A browser-based tool that allows users to write and execute code snippets in various languages, combined with markdown for rich-text explanations.",
    "content": "<div><p>Inspired by tools like Jupyter Notebooks, this project aims to create a lightweight, web-native environment for technical documentation and tutorials. It uses WebAssembly to run code interpreters for languages like Python and JavaScript directly in the browser, providing a sandboxed and secure execution environment. The application is built with Next.js and features a Monaco Editor integration for a rich code editing experience. Users can create 'notebooks' composed of markdown cells and code cells, and the output of code execution is rendered directly below the cell. Notebooks can be saved locally or shared via a unique URL.</p></div>",
    "date": "2024-07-28",
    "tags": ["webassembly", "react", "nextjs", "education", "monaco-editor"],
    "thumbnail": "project-5-thumb"
  }
]
